var week=["星期日","星期一","星期二","星期三","星期四","星期五","星期六","任何时间"]

var month=["一月","二月","三月","四月","五月","六月","七月","八月","九月","十月","十一月","十二月"]

var date=new Array("年","月","日")

var timeTable=[
[0,"-12:00","安尼威吐克, 瓜加林岛"],
[1,"-11:00","美國的中西部, 薩摩亞"],
[2,"-10:00","夏威夷"],
[3,"-09:00","阿拉斯加"],
[4,"-08:00","太平洋標準時間 (美國,加拿大)"],
[5,"-07:00","亞利桑那州, 山脉標準時間 (美國,加拿大)"],
[7,"-06:00","中元標準時間 (美國,加拿大), 墨西哥, 德古斯加巴(宏都拉斯首都)"],
[10,"-05:00","波哥大, 利瑪(秘鲁首都), 基多(厄瓜多爾首都)"],
[11,"-05:00","東方標準時間 (美國,加拿大), 印第安納州 (東邊)"],
[13,"-04:00","大西洋標準時間 (美國,加拿大), 卡拉卡斯(委内瑞拉首都), 拉巴斯"],
[54,"-03:30","紐芬蘭"],
[16,"-03:00","布宜諾斯艾利斯(阿根廷首都), 喬治城,巴西利亞"],
[19,"-02:00","中部-阿根廷"],
[20,"-01:00","亞速爾群島, 德總角."],
[22,"+00:00","卡薩布蘭卡市, 蒙羅維亞, 都柏林, 愛丁堡, 里斯本(葡萄牙首都), 倫敦"],
[24,"+01:00","阿姆斯特丹, 柏林, 伯恩, 羅馬, 斯德哥爾摩, 維也納"],
[25,"+01:00","貝爾格莱德,布拉迪斯拉發, 布逹佩斯, 爐布爾雅那, 布拉格"],
[26,"+01:00","布鲁塞爾, 哥本哈根, 馬德里, 巴黎, 維爾紐斯"],
[27,"+01:00","薩拉熱窩, 斯科普里, 索非亞, 華沙, 札格拉布"],
[30,"+02:00","雅典, 布加勒斯特, 開羅, 伊斯坦布爾, 明斯克"],
[31,"+02:00","哈拉雷, 赫爾辛基, 耶路撒冷, 普利托里亞, 里加, 塔林"],
[36,"+03:00","莫斯科, 聖彼得堡, 窩内河, 巴格逹, 科威特, 利雅德"],
[55,"+03:30","德黑蘭"],
[39,"+04:00","阿布逹比, 巴庫, 馬斯喀特, 第比利斯"],
[56,"+04:30","喀布爾"],
[41,"+05:00","凱撒琳镇,伊斯蘭馬,克拉啻港市, 塔什干"],
[57,"+05:30","新德里"],
[42,"+06:00","亞斯塔蔕,阿曼蔕,可倫波,狄哈卡"],
[43,"+07:00","曼谷,河内,雅加逹"],
[45,"+08:00","北京,香港,新加坡,台北"],
[46,"+09:00","漢城,東京,亞庫次客"],
[58,"+09:30","愛得萊德，逹爾文"],
[47,"+10:00","坎培拉,關島,摩爾斯比港,海蔘威"],
[51,"+11:00","麥哲倫,所羅門島"],
[52,"+12:00","斐濟,勘查加半島,威爾尼頓"]];

var Alerts=new Array(
"無效的"
,"!"
,"IP 位址"
,"子網路遮罩"
,"通訊閘"
,"主要的 DNS 位址"
,"使用者名稱"
,"您確定要改變密碼嗎?"
,"無效的名稱"
,"名稱 "
,"請勿輸入字元: ;:~`!?@#$%^\&*=+|*,></{}[]\'\"_"
,"無效的個人IP位址"
,"輸入的IP必須是LAN IP。"
,"輸入的IP是系統的IP位址。"
,"無效的公用服務埠"
,"結束端口值必須大於開始端口值"
,"無效的個人服務埠"
,"請輸入名稱"
,"觸發"
,"連接埠範圍"
,"開始連接埠應小於或等於結束連接埠。"
,"開始連接埠"
,"結束連接埠"
,"連接埠值必須介於1到65535之間!"
,"有效的公用埠格式: \n\n1.單一數字,如 1024\t\n2.一連串數字,如. 103,163,55,...\n3.數字範圍,如. 103-157\n4.混合,如. 103,106-1333,154"
,"這個特殊應用程式項目已經存在。"
,"公用埠已經被虛擬伺服器"
,"所使用了。"
,"特殊應用程式最多可以建立"
,"筆資料。\n\n請先刪除不用的資料。"
,"您確定要刪除此項目?"
,"這一個項目已經被設定過了。"
,"無效的排程範圍"
,"IP 過濾器最多可建立"
,"筆資料。\n\n請先刪除不用的資料。"
,"MAC 名稱"
,"無效的MAC名稱。"
,"MAC 位址"
,"無效!必須是unicast位址。"
,"MAC 位址必須要填寫。"
,"MAC 位址重覆。"
,"MAC 過濾器最多可建立"
,"筆資料。\n\n請刪除不用的資料。"
,"關鍵字必須填寫。"
,"URL 過濾器最多可建立"
,"筆資料。\n\n請刪除不用的資料。"
,"關鍵字已經存在。"
,"阻絕網域和允許網域不可同時為空白。"
,"阻絕網域"
,"這項阻絕網域已經建立。"
,"允許網域"
,"這項允許網域已經建立。"
,"阻絕網域最多可建立"
,"筆資料。\n\n請刪除不用的資料。"
,"允許網域最多可建立"
,"筆資料。\n\n請刪除不用的資料。"
,"虛擬伺服器最多可建立"
,"筆資料。\n\n請刪除不用的資料。"
,"位址範圍!"
,"開始位址!"
,"開始位址應小於或等於結束位址。"
,"結束位址!"
,"來源IP"
,"輸入的來源開始IP必須是LAN IP"
,"目的IP"
,"輸入的目的開始IP必須是LAN IP"
,"LAN to LAN 是無效的設定"
,"WAN to WAN 是無效的設定"
,"防火牆最多可建立"
,"筆資料。\n\n請刪除不用的資料。"
,"主機名稱不能為空白！"
,"使用者帳號不能為空白！"
,"使用者密碼不能為空白！"
,"使用者密碼"
,"DDNS 沒有啟動"
,"使用者帳號"
,"IP 位址"
,"密碼長度超出範圍!!!"
,"從本機硬碟載入設定值。"
,"請選擇檔案"
,"回復設定至出廠預設值。"
,"您確定要升級嗎?"
,"主機名稱或IP位址不能為空白。"
,"您確定要重新啟動嗎?"
,"無效的遠端記錄伺服器"
,"遠端記錄伺服器"
,"無效的 SMTP 伺服器!"
,"無效的 E-mail 位址!"
)

var Allow="允許";
var Deny="拒絕";

var Button_txt=['下一步','上一步','離開','說明','重新啟動','完成','確认','取消','繼續'];
var topmenu=['首頁','進階設定','工具','系統狀態','说明','首頁'];
var leftmenu=['連線精靈','虛擬伺服器','特殊應用程式','過濾器','防火牆','管理者系統','時間設定','系統設定','韌體更新','其他項目'
,'系統訊息','系統記錄','流量統計'];

var wizard = new Array(
"歡迎使用設定連線精靈。"
,"連線精靈將引導設定四項快速步驟。請鍵入 下一步。"
,"步驟 1. 設定網際網路連線"
,"步驟 2. 重新啟動"
,"步驟 3. 韌體更新"
,"選擇 WAN 型態"
,"選擇連線的方式來連接您的 ISP 。 鍵入下一步以便繼續。"
,"動態 IP 位址"
,"從您的網際網路服務提供者得到一個 IP 位址。."
,"固定 IP 位址"
,"輸入您的網際網路服務提供者所提供之固定 IP 位址設定資訊。"
,"PPPoE"
,"提供給您的是 PPPoE 服務，請選擇此項目 。"
,"設定動態 IP 地址"
,"請輸入一個特定的主機名稱或主機特定MAC位址。 從用戶端複製 MAC 位址 此按鍵複製網路卡上的 MAC 位址。按下下一步以便繼續。"
,"主機名稱"
,"(可不填)"
,"MAC 位址"
,"(可不填)"
,"设定完成"
,"设定连线精灵完成后，点击上一步便可回到前面的步骤去更改设定。点选重新启动则存储现有设定，Ralink Wireless Access Point。并重新启动Ralink Wireless Access Point。"
,"設定固定 IP 地址"
,"請輸入 ISP 提供給您之固定 IP 資訊。 按下一步以便繼續。"
,"WAN IP 位址"
,"WAN 子網路遮罩"
,"WAN 通訊閘"
,"主要的 DNS 位址"
,"次要的 DNS 位址"
,"设定完成"
,"设定连线精灵完成后，点击上一步便可回到前面的步骤去更改设定。点选重新启动则存储现有设定，Ralink Wireless Access Point。并重新启动Ralink Wireless Access Point."
,"設定 PPPoE "
,"服務名稱可不填，但是若您的 ISP 需要此資訊，請輸入適當的值。鍵入 下一步以便繼續。"
,"使用者帳號"
,"使用者密碼"
,"確認密碼"
,"服務名稱"
,"(可不填)"
,"設定完成"
,"設定連線精靈完成後 點選 "
,"上一步"
,"便可回到前面的步驟去更改設定。點選"
,"重新啟動"
,"則儲存現有設定，並重新啟動 Ralink Wireless Access Point。"
,"從用戶端複製 MAC 位址"
,"恢復出廠 MAC 位址"
,"(可不填)"
,"請輸入PPTP適當的設定值。鍵入"
,"下一步"
,"以便繼續。"
,"IP 位址"
,"子網路遮罩"
,"伺服器 IP 位址"
,"使用者帳號"
,"使用者密碼"
,"確認密碼"
,"請輸入l2TP適當的設定值。鍵入"
,"下一步"
,"以便繼續。"
,"IP 位址"
,"子網路遮罩"
,"伺服器 IP 位址"
,"使用者帳號"
,"使用者密碼"
,"確認密碼"
)

var wz_save=new Array(
"重新啟動!"
,"只有管理員才能改變設定"
,"錯誤!"
)

var wz_fw=new Array(
"為了加強Ralink Wireless Access Point功能，建議您下載最新韌體，以下連結為下載網址。"
,"最新韌體下載網址"
)

var wanst=new Array(
"WAN 設定 "
,"動態IP位址"
,"自動地從網際網路服務提供者得到一個 IP 位址。"
,"固定IP位址"
,"請輸入網際網路服務提供者所提供之固定 IP 位址設定資訊。"
,"PPPoE"
,"網際網路服務提供者提供 PPPoE 服務，請選擇此項目。"
,"動態 IP 位址"
,"主機名稱"
,"(可不填)"
,"MAC 位址"
,"(可不填)"
,"恢复出场MAC位址"
,"从用户端复制MAC位址"
,"主要的 DNS 伺服器"
,"次要的 DNS 伺服器"
,"(可不填)"
,"MTU"
,"自動重新連線"
,"啟動"	
,"關閉"
,"固定 IP 位址"
,"IP 位址"
,"子網路遮罩"
,"ISP 閘道器位址"
,"動態的 PPPoE"
,"固定的 PPPoE "
,"PPPoE 使用者名稱"
,"PPPoE 使用者密碼"
,"確認密碼"
,"服務名稱"
,"最大閒置時間"
,"分"
,"連線方式"
,"自動連線"
,"手動連線"
,"有流量時連線 "
,"PPTP 用戶端"
,"動態的 IP"
,"固定的 IP"
,"閘道器"
,"伺服器 IP 位址/名稱"
,"PPTP 使用者帳號"
,"PPTP 使用者密碼"
,"L2TP 使用者帳號"
,"L2TP 使用者密碼"
,"秒"
,"L2TP 用戶端"
)

var lanst=new Array(
"LAN 設定"
,"IP 位址"
,"子網路遮罩"
,"網域名稱"
,"DNS 中繼"
,"啟動"
,"關閉"
,"(可不填)"
)

var dhcpst= new Array(
"DHCP 伺服器"
,"DHCP 伺服器"
,"啟動"
,"關閉"
,"可用 IP 範圍起始位址"
,"可用 IP 範圍結束位址"
,"租約時間"
,"1小时"
,"2小时"
,"3小时"
,"1天"
,"2天"
,"3天"
,"1星期"
,"固定 DHCP"
,"啟動"
,"關閉"
,"主機名稱"
,"IP 位址"
,"MAC 位址"
,"DHCP 用戶端"
,"固定 DHCP 用戶列表"
,"(筆數/總筆數)"
,"主機名稱"
,"IP 位址"
,"MAC 位址"
,"動態 DHCP 用戶列表"
,"主機名稱"
,"IP 位址"
,"MAC 位址"
,"結束時間"
,"(筆數/總筆數)"
,"複製到"
)

var wlanst=new Array(
"WLAN 狀態"
,"系統資訊"
,"無線網路"
,"其他資訊"
)

var adv_virtual=new Array(
"虛擬伺服器"
,"啟動"
,"關閉"
,"名稱"
,"個人 IP 位址"
,"協定模式"
,"公用服務埠"
,"個人服務埠"
,"排程"
,"任何時間"
,"從"
,"每個"
,"到"
,"日期"
,"到"
,"虛擬伺服器列表"
,"名稱"
,"個人IP位址"
,"協定"
,"排程"
,"(筆數/總筆數)"
)


var adv_appl=new Array(
"特殊應用程式"
,"啟動"
,"關閉"
,"名稱"
,"觸發埠"
,"觸發器模式"
,"公用埠"
,"公用模式"
,"特殊應用程式列表"
,"名稱"
,"觸發器"
,"公用埠"
,"(筆數/總筆數)"
)

var adv_filters_ip=new Array(
"過濾器"
,"IP 位址過濾"
,"MAC 位址過濾"
,"URL 阻絕"
,"網域阻絕"
,"IP 位址過濾"
,"啟動"
,"關閉"
,"IP 位址"
,"埠"
,"協定"
,"排程"
,"任何時間"
,"從"
,"每個"
,"到"
,"日期 "
,"到"
,"IP 伺服列表"
,"IP(網域範圍)"
,"協定"
,"排程"
,"(筆數/總筆數)"
)

var adv_filters_mac=new Array(
"過濾器"
,"允許或拒絕使用者從LAN端存取網際網路。"
,"IP位址過濾"
,"MAC位址過濾"
,"URL阻絕"
,"網域阻絕"
,"MAC 位址過濾"
,"使用MAC位址來允許或拒絕使用者使用網路。"
,"關閉 MAC 過濾"
,"只"
,"允許"
,"下述 MAC 位址使用者存取網路。"
,"只"
,"拒絕"
,"下述 MAC 位址使用者存取網路。"
,"MAC 名稱"
,"MAC 位址"
,"DHCP 用戶端"
,"MAC 位址過濾列表"
,"MAC 名稱"
,"MAC 位址"
,"(筆數/總筆數)"
)

var adv_filters_url=new Array(
"過濾器"
,"允許或拒絕使用者從LAN端存取網際網路。"
,"IP位址過濾"
,"MAC位址過濾"
,"URL阻絕"
,"網域阻絕"
,"URL 阻絕"
,"阻絕包含列表中關鍵字的URLs."
,"啟動"
,"關閉"
,"(筆數/總筆數)"
)

var adv_filters_domain=new Array(
"過濾器"
,"允許或拒絕使用者從LAN端存取網際網路。"
,"IP位址過濾"
,"MAC位址過濾"
,"URL阻絕"
,"網域阻絕"
,"網域阻絕"
,"關閉"
,"允許"
,"使用者存取阻絕網域以外的所有網域。"
,"拒絕"
,"使用者存取允許網域以外的所有網域。"
,"阻絕網域"
,"允許網域"
,"(筆數/總筆數)"
)

var adv_firewall=new Array(
"防火牆"
,"啟動"
,"關閉"
,"名稱"
,"功能"
,"允許"
,"拒絕"
,"使用介面"
,"IP 位址"
,"協定"
,"埠範圍"
,"來源"
,"目的"
,"排程"
,"任何時間"
,"從"
,"每個 "
,"到 "
,"日期 "
,"到 "
,"防火牆列表"
,"功能"
,"名稱"
,"來源"
,"目的"
,"協定"
,"(筆數/總筆數)"
,"清除"
)

var adv_ddns=new Array(
"Dynamic DNS"
,"DDNS"
,"啟動"
,"關閉"
,"提供者"
,"主機名稱"
,"使用者帳號/電子郵件"
,"使用者密碼/鍵值"
,"連缐測試"
,"更新"
)

var adv_dmz=new Array(
"DMZ"
,"啟動"
,"關閉"
,"IP 位址"
)

var admin=new Array(
"管理者系統工具"
,"理者 (登入名稱為 \"admin\")"
,"新密碼"
,"確認新密碼"
,"遠端管理者主機"
,"啟動"
,"關閉"
,"IP 位址"
,"埠"
)

var time=new Array(
"時間設定"
,"目前系統時間 :"
,"裝置對時:"
,"啟動NTP"
,"您的電腦"
,"手動設定裝置日期與時間"
,"時區"
,"日光節約時間"
,"啟動"
,"關閉"
,"自動和 NTP 伺服器對時"
,"預設 NTP 伺服器"
,"(可不填)"
,"時間"
,"年:"
,"月:"
,"日:"
,"時:"
,"分:"
,"秒:"
)

var config=new Array(
"系統設定"
,"備份目前設定值"
,"從本機硬碟載入設定值"
,"载入"
,"回復設定至出廠預設值"
,"回復設定"
)

var firmware=new Array(
"韌體更新"
,"注意！系統進行韌體更新時不可關閉電源；系統完成更新會自動重新啟動。"
,"目前韌體版本:"
,"韌體日期:"
)

var misc=new Array(
"偵測測試"
,"主機名稱或者 IP 位址"
,"偵測"
,"重新啟動裝置"
,"重新啟動"
,"忽略來自 WAN 端的 PING"
,"忽略來自 WAN 端的 PING"
,"啟動","關閉"
,"UPnP 設定"
,"啟動","關閉"
,"啟動","關閉"
,"啟動","關閉"
,"啟動","關閉"
,"使用非標準的 FTP 連接埠"
,"設定此項目存取使用非標準的 FTP 連接埠。"
,"連接埠:"
)

var info=new Array(
"系統訊息"
,"天"
,"裝置啟動時間:"
,"軔體版本:"
,"LAN 端"
,"MAC 位址"
,"IP 位址"
,"子網路遮罩"
,"DHCP 伺服器"
,"關閉"
,"啟動"
,"WAN 端"
,"MAC 位址"
,"連線狀態"
,"閘道器"
,"DNS 伺服器"
,"DHCP釋放"
,"DHCP更新"
,"連線"
,"斷線"
)
var typeStr=["" , "固定 IP","動態 IP","PPPoE","PPTP","L2TP"];
var statStr=["斷線","連線","連線中"];

var log=new Array(
"系統記錄"
,"點選 \"系統記錄設定\" 按鈕做更進階的設定。"
,"第一頁"
,"最後一頁"
,"上一頁"
,"下一頁"
,"清除"
,"系統記錄設定"
,"更新"
,"時間"
,"訊息"
)

var log_settings=new Array(
"系統記錄"
,"您可以將系統記錄傳送到管理者的電子郵件信箱或是網路上可以接收系統記錄的伺服器儲存。"
,"遠端記錄伺服器"
,"遠端記錄伺服器 / IP 位址"
,"啟動"
,"關閉"
,"E-Mail 通知"
,"SMTP 伺服器 / IP 位址"
,"E-mail 位址"
,"現在傳送"
,"儲存記錄檔案至硬碟"
,"儲存"
,"記錄模式"
,"系統活動"
,"除錯資料"
,"駭客"
,"傳送封包"
,"公告"
)

var stats=new Array(
"流量統計"
,"更新頁面"
,"重置"
,"接收"
,"傳送"
,"封包"
)

var help=new Array(
"首頁"
,"連線精靈"
,"WAN 設定"
,"LAN 設定"
,"DHCP 伺服器"
,"WLAN 設定"
,"進階設定"
,"虛擬伺服器"
,"特殊應用程式"
,"過濾器"
,"防火牆"
,"系統工具"
,"管理者系統工具 "
,"時間設定"
,"系統設定 "
,"韌體更新"
,"其他設定"
,"系統狀態"
,"系統資訊"
,"系統記錄"
,"流量統計"
)

var help_home=new Array(
"首頁"
,"選擇連線型態"
,"連線精靈可以快速地協助您設定並連接到您的 ISP。"
,"WAN 設定"
,"WAN 設定是用來設定並連線到您的ISP。"
,"LAN 設定"
,"LAN 端的 IP 設定。"
,"DHCP 伺服器"
,"連接到本裝置的 DHCP 用戶資訊都會被顯示在用戶列表中。"
,"WLAN狀態"
,"WLAN 端的網路狀態。"
)

var help_adv=new Array(
"進階設定"
,"虛擬伺服器 說明"
,"可以讓網際網路的使用者存取到區域網路上之 WWW、FTP及其它網路服務。"
,"特殊應用程式 說明"
,"某些應用程式需要多個連接，像網路遊戲、視訊會議以及網路電話…等。"
,"過濾器 說明"
,"過濾器用於 LAN 端的電腦允許或者拒絕存取網際網路上的資料。過濾器可以使用於受限制的 Web 端阻絕使用者存取。"
,"防火牆"
,"防火牆用於允許或者拒絕封包資料通過機器。 "
,"DDNS"
,"設定動態 DNS 功能。"
,"DMZ"
,"設定在 DMZ 下的電腦可無限制存取網際網路。 "
,"Wi-Fi Basic Setup"
,"配置最基本的無線網路設定來建立無線網路環境。 "
,"Wi-Fi Advanced Setup"
,"設置更詳細的無線網路設定，像Beacon Interval、Control Tx Rates和Basic Data Rates...等。 "
,"Wi-Fi Block Ack Setup"
,"設定無線網路Block Ack機制。"
,"Wi-Fi Security Setup"
,"AP支援四種不同類型的無線網路安全機制，支援標準無線安全規範如: Wi-Fi Protected Access (WPA) Pre-Shared key、WPA Remote Access Dial In User Service (RADIUS)、 802.1X 和Wire Equivalence Protection (WEP)。User Service (RADIUS)、 802.1X 和Wire Equivalence Protection (WEP)。"
,"WPS Configuration Setup"
,"支援WPS，輕鬆完成您的連線設定。 "
,"WPS Device Configure"
,"選擇使用PIN碼或按鍵來設定WPS功能。"
,"WPS Reset Configuration"
,"恢復至原廠設定值。 "
,"AP-Client Configuration Setup"
,"配置無線網路AP-Client功能。 "
)

var help_tools=new Array(
"工具"
,"管理者系統工具"
,"提拱管理者介面來存取 web 瀏覽器。"
,"時間設定"
,"設定符合的位置的時區。"
,"系統設定"
,"目前的系統設定可以被儲存成一個檔案到您的硬碟中。 "
,"韌體更新"
,"按下 \"瀏覽\" 在您的硬碟中選擇要更新的韌體。"
,"其他項目"
,"其他項目包含附加的功能與設定。"
)

var help_status=new Array(
"狀態"
,"系統資訊"
,"顯示本產品的系統資訊。"
,"系統記錄"
,"存放本裝置執行的記錄和發生在裝置上的事件。"
,"流量統計"
,"統計流量。"
)

var err_msg = ["錯誤","儲存錯誤","超出範圍", "Ping結果: 時間到","只有管理員才能改變設定","無效的檔案"];
var ok_msg=["成功", "儲存設定",	 "Ping結果: 存活! ", "重新啟動","電子郵件已送出","更新完成","更新完成","連線中" ];
var do_cmd=new Array(
"錯誤"
,"成功"
,"更新中.."
)